{
  "title": "A Layout",
  "slug": "/charts/the-layout",
  "excerpt": "Here, an Overview of a layout which mixes scrolling and 'sticky' chart elements",
  "order": 1,
  "explanations": [
    "From the outside-in, this layout contains a wrapping div. This has minimal constraining styles.",
    "Inside the wrapping div are 2 sections. These have 100% width, some padding & margins, display set to flex and the flex alignment set at the element start.",
    "The widths of each section/column are set to my liking here & the important detail about column widths is that here the combined width is 100% of the available space.",
    "The first section, the left column, has position set to sticky. The section has a fixed height in this case. The div has a 100% width with max-width @ 40%. This section has a border, so that it is easily recognizable.",
    "The second section, the right column, has a fixed height in this case to 800px. The section has width set to 100% with max-width set to 60%. This section has a border, so that it is easily recognizable."
  ],
  "sections": [
    {
      "box": {
        "data": "Here, a box. This box is 'sticky'. The height is set through css-in-js. The 'sticky' position is also set through css-in-js."
      },
      "column": {
        "data": "Here, a column. This column is 'scrollable'. As this item scrolls, this item will 'move up' as the squaure on the left will look 'stuck'."
      },
      "className": "chart-layout"
    },
    {
      "box": {
        "data": "Here, another box. This box is, again, is 'sticky'. The height is set through css-in-js. The 'sticky' position is also set through css-in-js."
      },
      "column": {
        "data": null,
        "itm": "TheLayout"
      },
      "className": "chart-layout"
    }
  ],
  "footer": {
    "text": "With the layout laid out, the next section covers introducting SVG elements into the left-side box.",
    "link": {
      "text": "Including SVG",
      "url": "charts/adding-svg-to-a-layout"
    }
  }
}
