{
  "title": "Frontend Build System Tooling Overview",
  "slug": "febs/overview",
  "sections": [
    {
      "class": "hope-gap",
      "title": "The Gap",
      "listitems": [
        {
          "title": "",
          "content": "I Don't know what tools are being used when I build a website using react"
        },
        {
          "title": "",
          "content": "I can build a project with create-react-app, and I've heard about webpack, but I don't know whats going between them"
        }
      ]
    },
    {
      "class": "hope-gap",
      "title": "The Hope",
      "subTitle": "As a developer I'd like to...",
      "listitems": [
        {
          "title": "",
          "content": "...understand the tooling"
        },
        {
          "title": "",
          "content": "...be able to articulate the tolls that I'm using"
        },
        {
          "title": "",
          "content": "...be able to give at least an overview of how these tools are working together"
        },
        {
          "title": "",
          "content": "...have my own boilerplate project where I've compiled react/webpack/babel etc."
        },
        {
          "title": "",
          "content": "...understand and being able to assemble a frontend app using the tools of react, webpack, babel, npm, and node."
        }
      ]
    },
    {
      "class": "practice",
      "title": "The Practice",
      "subTitle": "Here's a few one-liners to give an overview of the tooling",
      "listitems": [
        {
          "title": "React",
          "content": "A lightweight JavaScript library used for building component-focused UIs (almost lifted directly from their website!). In a frontend build system, React builds the entire UI from an otherwise empty html document."
        },
        {
          "title": "Webpack",
          "content": "An npm module used to 'compile' or 'bundle' javascript. In a frontend build system, webpack shrinks the size of the javascript that is delivered to the browser. Webpack dev server is also used as a server during the development process."
        },
        {
          "title": "Babel",
          "content": "A module that transforms code when the syntax is not natively readable by a browser. Browsers don't know what to do with JSX."
        },
        {
          "title": "NPM",
          "content": "NPM hosts a bunch of code (repositiories) that are writtend and 'packaged' up for folks like us to install and use."
        },
        {
          "title": "Node",
          "content": "With the node runtime, JS can run on a server. Node is used here to develop an http server. Node is an underlying tech, and a frontend build system hardly writes any core node code."
        }
      ],
      "links": [
        {
          "txt": "React",
          "url": "https://reactjs.org/"
        },
        {
          "txt": "Webpack",
          "url": "https://webpack.js.org/"
        },
        {
          "txt": "Babel",
          "url": "https://babeljs.io/"
        },
        {
          "txt": "NPM",
          "url": "https://www.npmjs.com/"
        },
        {
          "txt": "Node",
          "url": "https://nodejs.org/en/"
        }
      ]
    }
  ],
  "footer": {
    "text": "Setup NPM",
    "link": {
      "text": "next ->",
      "url": "febs/npm-setup"
    }
  }
}
